---
kind: method
id: M:Autodesk.Revit.DB.Structure.AreaReinforcement.GetHostId
source: html/f01b201e-507f-0100-6d58-de49f981a449.htm
---
# Autodesk.Revit.DB.Structure.AreaReinforcement.GetHostId Method

The element that contains the Area Reinforcement.

## Syntax (C#)
```csharp
public ElementId GetHostId()
```

## Returns
The element that the Area Reinforcement object belongs to, such as a structural
 wall, floor or foundation.